# PRATICA INDEPENDENTE Joins com Pandas.

### Considerando os datframes a seguir, criados a partir de dicionários, atenda aos exercícios.

In [92]:
import pandas as pd

df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'], 
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR'],
                    'absences': [3, 2, 5, 1]
                   }
                  )
#df1

df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'], 
                    'hire_date': [2004, 2008, 2012, 2014]
                   }
                  )
#df2

df3 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'], 
                    'supervisor': ['Carly', 'Guido', 'Steve']
                   }
                  )
df3

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

#### Exercício 1: Usando a função `.merge()`, obter um dataframe como resultado da intersecão entre `df1` e `df2`.

In [93]:
df12 = pd.merge(df1, 
                df2, 
                on = "employee"
               )
df12

  employee        group  absences  hire_date
0      Bob   Accounting         3       2008
1     Jake  Engineering         2       2012
2     Lisa  Engineering         5       2004
3      Sue           HR         1       2014

#### Exercício 2: Calcule também a interseção entre o dataframe criado no exercício anterior e `df3`.

In [94]:
df_full = pd.merge(df12, 
                   df3, 
                   on = "group"
                  )
df_full

  employee        group  absences  hire_date supervisor
0      Bob   Accounting         3       2008      Carly
1     Jake  Engineering         2       2012      Guido
2     Lisa  Engineering         5       2004      Guido
3      Sue           HR         1       2014      Steve

#### Exercício 3: Usando o dataframe `df4` a seguir, gerar um novo dataframe que contenha o resultado dos três anteriores e `df4`.

In [95]:
df4 = pd.DataFrame({'applier': ['Bob', 'Jake', 'Lisa', 'Sue'], 
                    'position': ['CTO', 'Senior Developer', 'CFO', 'Head of HR']
                   }
                  )
df4

  applier          position
0     Bob               CTO
1    Jake  Senior Developer
2    Lisa               CFO
3     Sue        Head of HR

In [96]:
df_full = pd.merge(df_full, 
                   df4, 
                   left_on = "employee", 
                   right_on = "applier"
                  )
df_full

,employee,group,absences,hire_date,supervisor,applier,position
0,Bob,Accounting,3,2008,Carly,Bob,CTO
1,Jake,Engineering,2,2012,Guido,Jake,Senior Developer
2,Lisa,Engineering,5,2004,Guido,Lisa,CFO
3,Sue,HR,1,2014,Steve,Sue,Head of HR

#### Exercício 4: Usar o método [`.drop()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html) para eliminar as colunas redundantes.

In [97]:
df_full = df_full.drop("employee", 
                       axis = 1
                      )
df_full

         group  absences  hire_date supervisor applier          position
0   Accounting         3       2008      Carly     Bob               CTO
1  Engineering         2       2012      Guido    Jake  Senior Developer
2  Engineering         5       2004      Guido    Lisa               CFO
3           HR         1       2014      Steve     Sue        Head of HR

#### Exercício 5: Agrupe o dataframe do exercício 4 e calcule a contagem de grupos `group` supervisionado por cada supervisor `supervisor`.

In [101]:
df_fullGroups = df_full.groupby("supervisor")["group"].count().reset_index()
df_fullGroups

  supervisor  group
0      Carly      1
1      Guido      2
2      Steve      1

#### Exercício 6: Usando os DataFrames a seguir, realizar um `inner`, `outer`, `left` e `right` `join` entre eles. Antes de executar cada `join`, escrever um comentário com a saída esperada.

In [58]:
dfA = pd.DataFrame({"a":[1],
                    "b":[2],
                    "c":[3]
                   }
                  )
dfB = pd.DataFrame({"a":[1, 4],
                    "b":[7, 9],
                    "c":[8, 9]
                   }
                  )

#### `INNER JOIN`: Se unirmos pela coluna `a` esperamos que as colunas `b` e `c` apareçam com novos nomes na primeira linha do segundo dataframe.

In [59]:
pd.merge(dfA, 
         dfB, 
         on = "a", 
         how = "inner"
        )

   a  b_x  c_x  b_y  c_y
0  1    2    3    7    8

#### `LEFT JOIN`: Neste caso, esperamos o mesmo resultado que com `inner`.

In [60]:
pd.merge(dfA,
         dfB, 
         on = "a", 
         how = "left"
        )

   a  b_x  c_x  b_y  c_y
0  1    2    3    7    8

#### `OUTTER JOIN`: Esperamos que traga os dois casos com as colunas `b` e `c` em `null` para o segundo caso.

In [61]:
pd.merge(dfA, 
         dfB, 
         on = "a", 
         how = "outer"
        )

   a  b_x  c_x  b_y  c_y
0  1  2.0  3.0    7    8
1  4  NaN  NaN    9    9

#### `RIGHT JOIN`: Neste caso, esperamos o mesmo resultado que com `outer`.

In [62]:
pd.merge(dfA, 
         dfB, 
         on = "a", 
         how = "right"
        )

   a  b_x  c_x  b_y  c_y
0  1  2.0  3.0    7    8
1  4  NaN  NaN    9    9